#include "head.h"

Btn input(void)
{
    int i;
    printf("\33[5;40;35m*****欢迎来到英雄抽卡系统*****\033[0m\n");
    printf("\33[1;40;36m*****输入对应数字选择功能*****\033[0m\n");
    printf("\33[25;40;34m********1.创建角色*********\033[0m\n");
    printf("\33[25;40;31m********2.删除角色*********\033[0m\n");
    printf("\33[25;40;32m********3.查看角色*********\033[0m\n");
    printf("\33[25;40;33m********4.更改角色*********\033[0m\n");
    printf("\33[25;40;37m********5.更改角色*********\033[0m\n");
    scanf("%d",&i);
    while (getchar()!='\n');
    return i;
}